TexasInstruments/mcupsdk-core/examples/drivers/ospi/ospi_dual_flash_io/am261x-lp/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM261x_ZFG" --part "AM2612" --package "ZFG" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2612" --package "NFBGA (ZFG)" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.22.999+169"}
 */

/**
 * Import the modules used in this configuration.
 */
const flash           = scripting.addModule("/board/flash/flash", {}, false);
const flash1          = flash.addInstance();
const flash2          = flash.addInstance();
const ioexp           = scripting.addModule("/board/ioexp/ioexp", {}, false);
const ioexp1          = ioexp.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const clock           = scripting.addModule("/kernel/dpl/clock");
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
flash1.$name                              = "CONFIG_FLASH0";
flash1.proto_isAddrReg                    = true;
flash1.proto_cmdRegRd                     = "0x85";
flash1.proto_cmdRegWr                     = "0x81";
flash1.proto_mask                         = "0xff";
flash1.dummy_isAddrReg                    = true;
flash1.dummy_cfgReg                       = "1";
flash1.dummy_cmdRegRd                     = "0x85";
flash1.dummy_cmdRegWr                     = "0x81";
flash1.strDtr_isAddrReg                   = true;
flash1.strDtr_cmdRegRd                    = "0x85";
flash1.strDtr_cmdRegWr                    = "0x81";
flash1.strDtr_mask                        = "255";
flash1.strDtr_shift                       = 255;
flash1.proto_cfgReg                       = "0";
flash1.dummy_mask                         = "0xFF";
flash1.dummy_bitP                         = 16;
flash1.proto_bitP                         = 231;
flash1.flashSize                          = 8388608;
flash1.fname                              = "IS25LX064";
flash1.protocol                           = "8d_8d_8d";
flash1.flashDeviceId                      = "0x5B17";
flash1.peripheralDriver.$name             = "CONFIG_OSPI0";
flash1.peripheralDriver.OSPI.$assign      = "OSPI0";
flash1.peripheralDriver.OSPI.CLK.$assign  = "GPIO10";
flash1.peripheralDriver.OSPI.CSn0.$assign = "GPIO62";
flash1.peripheralDriver.OSPI.DQS.$assign  = "GPIO9";
flash1.peripheralDriver.OSPI.D7.$assign   = "GPIO68";
flash1.peripheralDriver.OSPI.D6.$assign   = "GPIO8";
flash1.peripheralDriver.OSPI.D5.$assign   = "GPIO67";
flash1.peripheralDriver.OSPI.D4.$assign   = "GPIO76";
flash1.peripheralDriver.OSPI.D3.$assign   = "GPIO69";
flash1.peripheralDriver.OSPI.D2.$assign   = "GPIO7";
flash1.peripheralDriver.OSPI.D1.$assign   = "GPIO70";
flash1.peripheralDriver.OSPI.D0.$assign   = "GPIO2";
flash1.peripheralDriver.child.$name       = "drivers_ospi_v0_ospi_v0_am261x_template0";

flash2.device                             = "CUSTOM_FLASH";
flash2.$name                              = "CONFIG_FLASH1";
flash2.fname                              = "MX25UW064";
flash2.fourByteEnableSeq                  = "0x20";
flash2.flashDeviceBusyTimeout             = 20000000;
flash2.flashPageProgTimeout               = 152;
flash2.flashSize                          = 8388608;
flash2.flashManfId                        = "0xC2";
flash2.flashDeviceId                      = "0x8137";
flash2.flashBlockSize                     = 65536;
flash2.resetType                          = "0x10";
flash2.deviceBusyType                     = "1";
flash2.cmdExtType                         = "INVERSE";
flash2.xspiWipRdCmd                       = "0x05";
flash2.dummyId8                           = 0;
flash2.protocol                           = "1s_1s_1s";
flash2.addressByteSupport                 = "0";
flash2.peripheralDriver.$name             = "CONFIG_OSPI1";
flash2.peripheralDriver.inputClkFreq      = 83333333;
flash2.peripheralDriver.OSPI.$assign      = "OSPI1";
flash2.peripheralDriver.OSPI.CLK.$assign  = "GPIO29";
flash2.peripheralDriver.OSPI.CSn0.$assign = "GPIO38";
flash2.peripheralDriver.OSPI.DQS.$assign  = "GPIO39";
flash2.peripheralDriver.OSPI.D7.$assign   = "GPIO37";
flash2.peripheralDriver.OSPI.D6.$assign   = "GPIO36";
flash2.peripheralDriver.OSPI.D5.$assign   = "GPIO35";
flash2.peripheralDriver.OSPI.D4.$assign   = "GPIO34";
flash2.peripheralDriver.OSPI.D3.$assign   = "GPIO33";
flash2.peripheralDriver.OSPI.D2.$assign   = "GPIO32";
flash2.peripheralDriver.OSPI.D1.$assign   = "GPIO31";
flash2.peripheralDriver.OSPI.D0.$assign   = "GPIO30";
flash2.peripheralDriver.child.$name       = "drivers_ospi_v0_ospi_v0_am261x_template1";

ioexp1.$name = "CONFIG_IOEXP0";

gpio1.pinDir         = "OUTPUT";
gpio1.defaultValue   = "1";
gpio1.$name          = "GPIO_OSPI_RST";
gpio1.GPIO_n.$assign = "GPIO61";

gpio2.$name          = "GPIO_FLASH1_RESET";
gpio2.pinDir         = "OUTPUT";
gpio2.defaultValue   = "1";
gpio2.GPIO_n.$assign = "GPIO66";

const i2c               = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1              = i2c.addInstance({}, false);
i2c1.$name              = "CONFIG_I2C0";
ioexp1.peripheralDriver = i2c1;
i2c1.I2C.$assign        = "I2C0";
i2c1.I2C_child.$name    = "drivers_i2c_v1_i2c_v1_template0";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART_LOG";
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "GPIO27";
debug_log.uartLog.UART.TXD.$assign = "GPIO28";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

